package com.example.sbdatajpademo.repository;

import com.example.sbdatajpademo.entity.Note;
import org.springframework.data.jpa.repository.JpaRepository;

public interface NoteRepository extends JpaRepository<Note, Long> {
}

/*
    Якщо ми говоримо про Spring Data, то Page та Slice є двома різними інтерфейсами, які дозволяють здійснювати пагінацію
    в результатах запитів до бази даних.

    Основна різниця між Page та Slice полягає в тому, як вони обробляють дані під час пагінації.
    Page використовує обмеження (limit) та зсув (offset) для вибірки даних з бази даних, тоді як Slice використовує лише
    обмеження, тобто вибирає певну кількість записів без врахування їх номеру у загальному списку.

    Отже, Page дозволяє повернути всі елементи результату запиту, які попадають у заданий діапазон сторінок, тоді як
    Slice повертає лише ті записи, які відповідають заданому діапазону сторінок. Це означає, що якщо ми хочемо вивести
    загальну кількість сторінок у результаті запиту, то ми повинні використовувати Page. У той же час, якщо нам потрібно
    повернути лише певну кількість записів, яка не залежить від загальної кількості записів, то ми можемо використовувати Slice.

 */